121312*PARSER IGNORES THIS
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLTEST5-ARRAYS-AND-LITS.
       AUTHOR. Luke Attard.
       DATE-WRITTEN. 12/5/2025.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  WS-ARRAY.
           05 WS-ARRAY-ITEM OCCURS 20 TIMES.
               10 WS-ARRAY-NUM                 PIC 9(10).

       

       PROCEDURE DIVISION.
      *PARSER SHOULD IGNORE THIS
       MOVE 200 TO WS-ARRAY-NUM(10)

       MOVE WS-ARRAY-NUM(10) TO WS-ARRAY-NUM(1)

       STOP RUN.
