121312*PARSER IGNORES THIS
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LITERALS-BEHAVIOUR.
       AUTHOR. Luke Attard.
       DATE-WRITTEN. 12/5/2025.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-VAR1             PIC 9(1) VALUE 1.
       01  WS-VAR2             PIC A(2) VALUE 36.
       01  WS-VAR3             PIC X(10) VALUE 100.


       PROCEDURE DIVISION.
      *PARSER SHOULD IGNORE THIS
       DISPLAY "ERROR HERE MOVE WS-VAR1 TO WS-VAR2 ".
       
       STOP RUN.
