121312*PARSER IGNORES THIS
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLTEST6-ARRS-AND-LITS-ERR.
       AUTHOR. Luke Attard.
       DATE-WRITTEN. 12/5/2025.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  WS-ARRAY.
           05 WS-ARRAY-ITEM OCCURS 20 TIMES.
               10 WS-ARRAY-NUM                 PIC 9(10).

       01  WS-INDEX                            PIC S9(3) VALUE 1.

       PROCEDURE DIVISION.
      *PARSER SHOULD IGNORE THIS
       PERFORM UNTIL WS-INDEX = 21
           MOVE WS-INDEX TO WS-ARRAY-NUM(WS-INDEX)
           DISPLAY WS-ARRAY-NUM(WS-INDEX)
           ADD 1 TO WS-INDEX
       END-PERFORM.

       STOP RUN.
