       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROVER.
       AUTHOR. Luke Attard.
       DATE-WRITTEN. 12/3/2025.

       DATA DIVISION.
 
       WORKING-STORAGE SECTION. 
           01 WS-TYPE-SATISFIED           PIC 9(1) VALUE 1.
           01 WS-CMD-ARG                  PIC X(256).
           01 WS-AST.
               05 WS-AST-NODES OCCURS 10000 TIMES.
                   10 WS-AST-NODE      PIC X(80).

           01 WS-VARIABLES.
               05 WS-VARS OCCURS 100 TIMES.
                   10 WS-VAR-NAME      PIC X(80).
                   10 WS-VAR-TYPE      PIC X(80).
                   10 WS-VAR-SIZE      pic 9(9).
           
           01 WS-VAR-SIZE-DISPLAY      PIC Z(9).
           
           
           01 WS-PROCEDURE-DIV-INDEX   PIC 9(16).

           01 WS-INDEX                 PIC 9(16) VALUE 1.
           01 WS-OPERATOR              PIC X(8).
           01 WS-PREPOSITION           PIC X(8).
      *    01 WS-LITERAL-TYPE          PIC X(8).
           01 WS-LITERAL-LENGTH        PIC 9(8).
           01 WS-TEMP-VAR1             PIC X(256).
           01 WS-TEMP-VAR2             PIC X(256).
           01 WS-TEMP-VAR3             PIC X(256).

           01 WS-TEMP-NUM1             PIC 9(16).
           01 WS-TEMP-NUM2             PIC 9(16).
           01 WS-TEMP-NUM3             PIC 9(16).
           01 WS-TEMP-NUM4             PIC 9(16).

       PROCEDURE DIVISION.       
      *Read command-line argument (filename)
       ACCEPT WS-CMD-ARG FROM COMMAND-LINE.
       CALL "PARSER" USING BY REFERENCE WS-CMD-ARG WS-AST.
       PERFORM POPULATE-VARS-ARRAY-PARA.
      *PERFORM DISPLAY-VARIABLES-PARA.
       PERFORM FIND-BAD-DATA-TRANSFER-PARA.

       IF WS-TYPE-SATISFIED = 1
       DISPLAY "THIS PROGRAM IS TYPE SATISFIED."
       ELSE
       DISPLAY "THIS PROGRAM IS NOT TYPE SATISFIED." 
       END-IF.

       STOP RUN.
       MOVE WS-TEMP-NUM1 TO WS-TEMP-VAR1.

       FIND-BAD-DATA-TRANSFER-PARA.
      *SET UP THE INDEX, WE NEED TO START READING AFTER THE PROC DIV
       MOVE WS-PROCEDURE-DIV-INDEX TO WS-INDEX.
       
       MOVE WS-AST-NODE(WS-INDEX) TO WS-TEMP-VAR1.
       PERFORM UNTIL WS-TEMP-VAR1 = SPACE
           MOVE WS-AST-NODE(WS-INDEX) TO WS-TEMP-VAR1
           EVALUATE WS-TEMP-VAR1
               WHEN "MOVE" 
               MOVE "MOVE" TO WS-OPERATOR
               MOVE "TO" TO WS-PREPOSITION
               PERFORM ON-OPERATOR-FOUND-PARA
               WHEN "ADD" 
               MOVE "ADD" TO WS-OPERATOR
               MOVE "TO" TO WS-PREPOSITION
               PERFORM ON-OPERATOR-FOUND-PARA
               WHEN "SUBTRACT" 
               MOVE "SUBTRACT" TO WS-OPERATOR
               MOVE "FROM" TO WS-PREPOSITION
               PERFORM ON-OPERATOR-FOUND-PARA
               WHEN "MULTIPLY" 
               MOVE "MULTIPLY" TO WS-OPERATOR
               MOVE "BY" TO WS-PREPOSITION
               PERFORM ON-OPERATOR-FOUND-PARA
      *        WHEN "DIVIDE" 
      *        MOVE "DIVIDE" TO WS-OPERATOR
      *        MOVE "FROM" TO WS-PREPOSITION
      *        PERFORM ON-OPERATOR-FOUND-PARA
               WHEN "COMPUTE"
               PERFORM ON-COMPUTE-FOUND-PARA
           END-EVALUATE
           ADD 1 TO WS-INDEX
       END-PERFORM.

       ON-COMPUTE-FOUND-PARA.
      *PROCEDURE WHEN A COMPUTE IS FOUND
       CALL "FIND_VAR" USING BY REFERENCE WS-AST-NODE(WS-INDEX + 1) 
       WS-VARIABLES WS-TEMP-NUM1.
       MOVE 2 TO WS-TEMP-NUM2.
      *FIRST WE NEED REFERENCE TO WHERE DATA IS MOVING
       MOVE WS-AST-NODE(WS-INDEX + WS-TEMP-NUM2) TO WS-TEMP-VAR2.
       PERFORM UNTIL WS-TEMP-VAR2 <> "=" AND WS-TEMP-VAR2 <> "+" AND 
       WS-TEMP-VAR2 <> "-" AND WS-TEMP-VAR2 <> "*" AND 
       WS-TEMP-VAR2 <> "/" AND WS-TEMP-VAR2 <> "**"
           ADD 1 TO WS-TEMP-NUM2
           CALL "FIND_VAR" USING BY REFERENCE 
           WS-AST-NODE(WS-INDEX + WS-TEMP-NUM2) 
           WS-VARIABLES WS-TEMP-NUM3
      *    GET THE NEXT VARIABLE AFTER ARITHMETIC OPERATOR +/-/*
           
           IF WS-TEMP-NUM3 = 0
      *    RETURNED 0 MEANS THE VARIBALE IS NOT FOUND
           DISPLAY "LITERAL IN COMPUTE"
           MOVE FUNCTION 
           LENGTH(FUNCTION TRIM(WS-AST-NODE(WS-INDEX + WS-TEMP-NUM2)))
           TO WS-LITERAL-LENGTH

           IF WS-VAR-SIZE(WS-TEMP-NUM1) < WS-LITERAL-LENGTH

           MOVE 0 TO WS-TYPE-SATISFIED
           DISPLAY "UNSAFE ACTION: COMPUTE " 
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM1)) 
           " UTILIZING LITERAL "
           FUNCTION TRIM(WS-AST-NODE(WS-INDEX + WS-TEMP-NUM2)) 
           " OF MISMATCHED SIZE"
           DISPLAY "TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM1)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM1)) 
           " <- TYPE: 9(ASSUMED) SIZE: " WS-LITERAL-LENGTH
           DISPLAY "SIZE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
           DISPLAY SPACES

           END-IF

           ELSE
           
           IF WS-VAR-TYPE(WS-TEMP-NUM1) <> WS-VAR-TYPE(WS-TEMP-NUM3)
           
           MOVE 0 TO WS-TYPE-SATISFIED
           DISPLAY "UNSAFE ACTION: COMPUTE " 
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM1)) 
           " UTILIZING VARIABLE "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM3)) 
           " OF MISMATCHED TYPE"
           DISPLAY "TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM1)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM1)) 
           " <- TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM3)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM3)) 
           DISPLAY "TYPE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
           DISPLAY SPACES

           END-IF

           IF WS-VAR-SIZE(WS-TEMP-NUM1) < WS-VAR-SIZE(WS-TEMP-NUM3)
           
           MOVE 0 TO WS-TYPE-SATISFIED
           DISPLAY "UNSAFE ACTION: COMPUTE " 
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM1)) 
           " UTILIZING VARIABLE "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM3)) 
           " OF MISMATCHED SIZE"
           DISPLAY "TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM1)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM1)) 
           " <- TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM3)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM3)) 
           DISPLAY "SIZE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
           DISPLAY SPACES

           END-IF
           END-IF
           
           ADD 1 TO WS-TEMP-NUM2
           MOVE WS-AST-NODE(WS-INDEX + WS-TEMP-NUM2) TO WS-TEMP-VAR2
       END-PERFORM.

       ON-OPERATOR-FOUND-PARA.
      *PROCEDURE WHEN A MOVE/ADD/SUBTRACT ETC STATEMENT IS ENCOUNTERED
       CALL "FIND_VAR" USING BY REFERENCE WS-AST-NODE(WS-INDEX + 1) 
       WS-VARIABLES WS-TEMP-NUM1.
       CALL "FIND_VAR" USING BY REFERENCE WS-AST-NODE(WS-INDEX + 3) 
       WS-VARIABLES WS-TEMP-NUM2.

       MOVE 1 TO WS-TEMP-NUM3.
       IF WS-TEMP-NUM2 = 0
      *    INVALID INPUT CASE, CANNOT MOVE DATA INTO A LITERAL
           MOVE 0 TO WS-TEMP-NUM3
      *    DISPLAY "INVALID CODE PROVIDED. "
      *    "CANNOT MOVE DATA INTO LITERALS."
      *    DISPLAY WS-AST-NODE(WS-INDEX + 1)
      *    DISPLAY WS-AST-NODE(WS-INDEX + 3)
       END-IF
       
       IF WS-TEMP-NUM3 = 1 AND WS-TEMP-NUM1 = 0
      *    THIS IS THE CASE WHERE THE FIRST ARG IS A LITERAL
           MOVE 0 TO WS-TEMP-NUM3
      *    DISPLAY "FIRST ARGUMENT LITERAL" 
           MOVE WS-AST-NODE(WS-INDEX + 1) TO WS-TEMP-VAR2
      *    CHECK IF THE LITERAL IS A STRING
           IF WS-TEMP-VAR2(1 : 1) = "'" OR WS-TEMP-VAR2(1 : 1) = '"'
               MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-TEMP-VAR2)) 
               TO WS-LITERAL-LENGTH
               SUBTRACT 2 FROM WS-LITERAL-LENGTH

               IF WS-VAR-TYPE(WS-TEMP-NUM2) <> "X"
      *        IF MOVING A LITERAL STRING INTO A NON STRING TYPE
               MOVE 0 TO WS-TYPE-SATISFIED
               DISPLAY "UNSAFE ACTION: " 
               FUNCTION TRIM(WS-OPERATOR) " "
               FUNCTION TRIM(WS-TEMP-VAR2) " " 
               FUNCTION TRIM(WS-PREPOSITION) " "
               FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM2))
               DISPLAY "TYPE: A/X (ASSUMED) SIZE: " WS-LITERAL-LENGTH
               " -> TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM2)) 
               " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM2)) 
               DISPLAY "POSSIBLE TYPE MISMATCH, "
               "POSSIBLE DATA LOSS/TRUNCATION."
               DISPLAY SPACES

               ELSE

               IF WS-LITERAL-LENGTH > WS-VAR-SIZE(WS-TEMP-NUM2)
      *        IF CRAMMING A STRING INTO A CONTAINER TOO SMALL
               MOVE 0 TO WS-TYPE-SATISFIED
               DISPLAY "UNSAFE ACTION: " 
               FUNCTION TRIM(WS-OPERATOR) " "
               FUNCTION TRIM(WS-TEMP-VAR2) " " 
               FUNCTION TRIM(WS-PREPOSITION) " "
               FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM2))
               DISPLAY "TYPE: A/X (ASSUMED) SIZE: " WS-LITERAL-LENGTH
               " -> TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM2)) 
               " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM2)) 
               DISPLAY "SIZE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
               DISPLAY SPACES
               END-IF

           ELSE 
      *    ELSE THE LITERAL MUST BE A NUMBER OF SOME SORT
               MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-TEMP-VAR2)) 
               TO WS-LITERAL-LENGTH
               
               IF WS-LITERAL-LENGTH > WS-VAR-SIZE(WS-TEMP-NUM2)

               MOVE 0 TO WS-TYPE-SATISFIED
               DISPLAY "UNSAFE ACTION: " 
               FUNCTION TRIM(WS-OPERATOR) " "
               FUNCTION TRIM(WS-TEMP-VAR2) " " 
               FUNCTION TRIM(WS-PREPOSITION) " "
               FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM2))
               DISPLAY "TYPE: 9 (ASSUMED) SIZE: " WS-LITERAL-LENGTH
               " -> TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM2)) 
               " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM2)) 
               DISPLAY "SIZE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
               DISPLAY SPACES
               END-IF
           END-IF

       END-IF
       
      
       IF WS-VAR-TYPE(WS-TEMP-NUM1) <> WS-VAR-TYPE(WS-TEMP-NUM2) AND 
       WS-TEMP-NUM3 = 1
      *IF TWO VARIABLES ARE IDENTIFIED TEST THEM ON TYPE FIRST
           
           MOVE 0 TO WS-TYPE-SATISFIED
           DISPLAY "UNSAFE ACTION: " 
           FUNCTION TRIM(WS-OPERATOR) " "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM1)) " " 
           FUNCTION TRIM(WS-PREPOSITION) " "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM2))
           DISPLAY "TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM1)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM1)) 
           " -> TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM2)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM2)) 
           DISPLAY "TYPE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
           DISPLAY SPACES
           
       END-IF
       IF WS-VAR-SIZE(WS-TEMP-NUM1) > WS-VAR-SIZE(WS-TEMP-NUM2) AND 
       WS-TEMP-NUM3 = 1
      *THEN TEST THE TWO VARIABLES ON SIZE
           MOVE 0 TO WS-TYPE-SATISFIED
           DISPLAY "UNSAFE ACTION: " 
           FUNCTION TRIM(WS-OPERATOR) " "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM1)) " " 
           FUNCTION TRIM(WS-PREPOSITION) " "
           FUNCTION TRIM(WS-VAR-NAME(WS-TEMP-NUM2))
           DISPLAY "TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM1)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM1)) 
           " -> TYPE: " FUNCTION TRIM(WS-VAR-TYPE(WS-TEMP-NUM2)) 
           " SIZE: " FUNCTION TRIM(WS-VAR-SIZE(WS-TEMP-NUM2)) 
           DISPLAY "SIZE MISMATCH, POSSIBLE DATA LOSS/TRUNCATION."
           DISPLAY SPACES
       END-IF.

       POPULATE-VARS-ARRAY-PARA.
      *CALL THE VARIABLE POPULATION FUNCTION
       CALL "POPULATE_VARS" USING BY REFERENCE WS-AST WS-VARIABLES
       WS-PROCEDURE-DIV-INDEX.
       
      *HELPER FUNCTION TO LET ME READ THE VARIABLES AS THEY ARE SAVED
       DISPLAY-VARIABLES-PARA.
       MOVE 1 TO WS-TEMP-NUM1.
       MOVE "START" TO WS-TEMP-VAR1.
       PERFORM UNTIL WS-TEMP-VAR1 = SPACES
       DISPLAY "NAME: " WS-VAR-NAME(WS-TEMP-NUM1)
       DISPLAY "TYPE: " WS-VAR-TYPE(WS-TEMP-NUM1)
       MOVE WS-VAR-SIZE(WS-TEMP-NUM1) TO WS-VAR-SIZE-DISPLAY
       DISPLAY "SIZE: " FUNCTION TRIM(WS-VAR-SIZE-DISPLAY)
       ADD 1 TO WS-TEMP-NUM1
       MOVE WS-VAR-NAME(WS-TEMP-NUM1) TO WS-TEMP-VAR1
       END-PERFORM.

       END PROGRAM PROVER.
           